{
  "backend/main.mo": "Empty Motoko actor with no backend logic.",
  "feature_evidence.json": "Feature evidence report mapping implemented features to their related files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Tailwind base styles with custom OKLCH color variables for light and dark themes.",
  "frontend/index.html": "HTML entry point defining root container and loading the React app.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps the app with CartProvider and SiteLayout.",
  "frontend/src/components/layout/Footer.tsx": "Responsive footer with brand info, links, social icons, and copyright line.",
  "frontend/src/components/layout/Header.tsx": "Responsive header with logo, navigation links, mobile menu, and cart badge.",
  "frontend/src/components/layout/SiteLayout.tsx": "Layout wrapper providing consistent header, footer, and main content area.",
  "frontend/src/components/products/ProductDetailsDialog.tsx": "Modal showing product details with size selection and add‑to‑cart handling.",
  "frontend/src/components/products/ProductGrid.tsx": "Grid of clickable product cards displaying images, category, and pricing.",
  "frontend/src/data/products.ts": "Defines a Product interface and exports a static array of product objects for the store catalog.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, updating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context, handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file indicating no backend queries are used, exporting nothing.",
  "frontend/src/index.css": "Configures Tailwind base styles and theme variables for light and dark mode.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider, then renders App.",
  "frontend/src/pages/AboutPage.tsx": "Renders the About page with a hero banner and content describing the brand’s story and philosophy.",
  "frontend/src/pages/CollectionsPage.tsx": "Shows a product grid from the static dataset and a dialog for viewing product details.",
  "frontend/src/pages/ContactPage.tsx": "Renders a contact form with validation, submission handling, and contact information icons.",
  "frontend/src/pages/HomePage.tsx": "Implements the homepage with a hero banner, featured products grid, and brand values section using navigation and product data.",
  "frontend/src/state/cart/CartProvider.tsx": "Defines a cart context provider handling item storage, persistence in sessionStorage, and add/remove/clear cart operations.",
  "frontend/src/state/cart/useCart.ts": "Provides a hook to access the cart context and enforce usage within the CartProvider.",
  "frontend/src/utils/validation.ts": "Contains simple validation helpers for email format and required field checks.",
  "frontend/tailwind.config.js": "Configures Tailwind theme settings, colors, typography, plugins, and extended design tokens for the project.",
  "project_state.json": "Stores metadata about the project including features, requirements, assets, and current project state."
}